<?php
/***************************************************************************
 *   Professional Download System                                          *
 *                                                                         *
 *   Copyright (C) pirdani                                                 *
 *   pirdani@hotmail.de                                                    *
 *   http://pirdani.de/                                                    *
 *                                                                         *
 *   Copyright (C) 2005 EdEdster (Stefan Noss)                             *
 *   http://edsterathome.de/                                               *
 *                                                                         *
 *   Copyright (C) 2006-2007 Artur Wiebe                                   *
 *   wibix@gmx.de                                                          *
 *   http://wibix.de/                                                      *
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *  --------------------------------------------------------------------   *
 *         Перевод на Русский язык: Skorpion - http://cst-m.ru             *
 *  --------------------------------------------------------------------   *
 ***************************************************************************/
$locale['PDP000'] = "Professional Download System";
$locale['PDP001'] = "Файловое хранилище";
$locale['PDP002'] = "Название";
$locale['PDP003'] = "Новое";
$locale['pdp_downloads'] = "Загрузки";
$locale['PDP005'] = "Опции";
$locale['PDP006'] = "Показать";
$locale['pdp_edit'] = "Редактировать";
$locale['PDP008'] = "Правдо удалить?";
$locale['PDP009'] = "Удалить";
$locale['PDP010'] = "Сохранить";
$locale['PDP011'] = "Пожалуста заполните все поля помеченые звездочкой (*)!";
$locale['PDP012'] = "Категория";
$locale['PDP013'] = "Дата";
$locale['PDP014'] = "Доступ";
$locale['PDP015'] = "Добавляем скриншоты";
$locale['PDP016'] = "Админ";
$locale['PDP017'] = "Не активные";
$locale['PDP018'] = "Версия";
$locale['PDP019'] = "Добавляем файлы";
$locale['PDP020'] = "Оф. сайт файла";
$locale['PDP021'] = "Коментарии";
$locale['PDP022'] = "Нет ниодной загрузки.";
$locale['PDP023'] = "Эта загрузка деактивирована и доступна только администрации и пользователю кто это добавил. Администрация может открыть доступ для скачивания к этому файлу.";
$locale['PDP024'] = "Сообщить о битой ссылке";
$locale['PDP025'] = "Описание";
$locale['PDP026'] = "Перейти к загрузкам";
$locale['PDP027'] = "Дополнительно";
$locale['PDP028'] = "Скриншот";
$locale['PDP029'] = "Размер файла";
$locale['PDP030'] = "Лицензия в комплекте с файлом";
$locale['PDP031'] = " on ";
$locale['PDP032'] = "Редактировать коментарии";
$locale['PDP033'] = "Пожалуста выбирете...";
$locale['PDP034'] = "Максимальный размер файла";
$locale['PDP035'] = "Вернутся";
$locale['PDP036'] = "Перейти в админку загрузок";
$locale['PDP037'] = "К списку";
$locale['PDP038'] = "Добавить файл";
$locale['PDP039'] = "О...";
$locale['PDP040'] = "Поиск";
$locale['PDP041'] = "Отключить смайлы";
$locale['PDP042'] = array(
	1	=>	"Шаг 1: Добавить описание...",
	2	=>	"Шаг 3: Загрузить файл...",
	3	=>	"Шаг 2: Прикрепить скриншот...",
	4	=>	"Шаг 4: Завершающий этап.",
);
$locale['PDP043'] = "OK";
$locale['PDP044'] = "К следующем шагу";
$locale['PDP045'] = "Далее к следующему действию";
$locale['PDP046'] = "Файл не найден";
$locale['PDP047'] = "Асистент отправки файлов";
$locale['PDP048'] = "Привет!<p>С помощью нескольких простых шагов, сейчас, мы добавим файл на сервер.";
$locale['PDP049'] = "Сообщение";
$locale['PDP050'] = "Сохранено!";
$locale['PDP051'] = "IP";
$locale['PDP052'] = "Последнее обновление";
$locale['PDP053'] = "Детали";
$locale['PDP054'] = "Ссылка";
$locale['PDP055'] = "Загрузка деактивирована.";
$locale['PDP056'] = "Максимум 100 символов";


// edit_desc.php
$locale['PDP101'] = "Другая лицензия";
$locale['PDP102'] = "Редактировать загрузку";
$locale['PDP103'] = "Новая загрузка";
$locale['PDP104'] = "Права";
$locale['PDP105'] = "Лицензия";
$locale['PDP106'] = "Редактировать файл лицензии";//file.php
$locale['PDP107'] = "URL Лицензии";
$locale['PDP108'] = "Описание как превью";
$locale['PDP109'] = "Максимум 255 символов";


// edit_files.php
$locale['PDP120'] = "Нет доступных файлов для загрузки.";
//
$locale['PDP123'] = "This area is just for backwards compatibility. Please use information from this area and add an download above. After that, delete this information.";//FIXME - better text
//
$locale['PDP125'] = "Загрузить";
$locale['PDP126'] = "Пустые поля";
$locale['PDP127'] = "Внешняя Загрузка";
$locale['PDP128'] = "Редактировать файлы";
$locale['PDP129'] = "Источник";
$locale['PDP130'] = "Вы хотите удалить файл на сервере тоже?";
$locale['PDP131'] = "Да";
$locale['PDP132'] = "Нет";
$locale['PDP133'] = "или";


// broken.php
$locale['PDP140'] = "Сообщить о битой ссылке";
$locale['PDP141'] = "<b>Администрация извещена о битой ссылке.<br>Спасибо за вашу внимательность.</b>";
//
$locale['PDP143'] = "Эта загрузочная ссылка действительно битая."."\n\nВаш IP - %ip";
$locale['PDP144'] = "сообщить";


// profile.php
$locale['PDP160'] = "Мои загрузки";
$locale['PDP161'] = "<b>ваш профайл</b>";
$locale['PDP162'] = "Пользователь скрыт";


// search.php
$locale['PDP180'] = "Используйте форму поиска чтобы найти то что вам нужно...";
$locale['PDP181'] = "совпадений найдено.";
$locale['PDP182'] = "Искомый текст";


// download.php (did.php)
$locale['PDP200'] = "Архив";
$locale['PDP201'] = "<b>З А Г Р У З И Т Ь <br> Ф А Й Л </b>";
$locale['PDP202'] = "Голосование";
$locale['PDP203'] = "Внешняя Лицензия";
$locale['PDP204'] = "Неизвестная Лицензия";
$locale['PDP205'] = array (
	"1"	=>	"Удивительный!",
	"2"	=>	"Очень Хороший",
	"3"	=>	"Хороший",
	"4"	=>	"Средне",
	"5"	=>	"Бедное содержание",
);
$locale['PDP206'] = "Голосовать";
//207
$locale['PDP208'] = "На данный момент ещё никто не проголосовал за этот файл";
$locale['PDP209'] = "Снять свой голос";
$locale['PDP210'] = "Мой голос";
$locale['PDP211'] = "Добавить коментарий";
$locale['PDP212'] = "Пока что никто не оставил коментарий для этой загрузки.";
$locale['PDP213'] = "Голосования";
$locale['PDP214'] = "из";
$locale['PDP215'] = "Эта категория требует права доступа %s.";//FIXME
$locale['PDP216'] = "Внешние ссылки должны начинатся с http://, https:// или с ftp://.";
$locale['PDP217'] = "URL";
$locale['PDP218'] = "FTP";
$locale['PDP219'] = "Загрузить";
$locale['PDP220'] = "Должно начинатся с http://, https:// или с ftp://.";
$locale['PDP221'] = "Размер будет определен автоматически, если оставить это поле пустым.";
$locale['PDP222'] = "Подкатегории";


// pro_download_panel.php
$locale['PDP300'] = "Новые загрузки";
$locale['PDP301'] = "ТОП %s загрузок";


// upload_done.php
$locale['PDP320'] = "Поздравляем!";
$locale['PDP321'] = "Ваша загрузка будет проверена модератором. Нажмите на - <b>Подтвердить</b> чуть ниже.";
$locale['PDP322'] = "Подтвердить";


// error.php
$locale['PDP340'] = "Вы читаете это, потому что произошла ошибка. Уточните ваши действия и повторите";


// license.php
$locale['PDP360'] = "Закрыть";


// edit_comments.php
$locale['PDP380'] = "IP";


// file.php
$locale['PDP400'] = "Я согласен с лицензией.";
$locale['PDP401'] = "Начать загрузку.";
$locale['PDP402'] = "Пожалуйста уважайте условия лицензии/авторского права владельца об использовании, перераспределении и модификациях загрузки.";
$locale['PDP403'] = "Этот пакет выпущен согласно неизвестной лицензии, которая включена в загрузку. Пожалуйста прочитайте это тщательно перед использованием.";
$locale['PDP404'] = "Этот пакет выпущен под неизвестной лицензией, которая расположена по адресу ниже. Пожалуйста прочитайте это тщательно перед использованием.";
$locale['PDP405'] = "Лицензия";
$locale['PDP406'] = "Пожалуйста уважайте права владельца!";


// edit_admin.php
$locale['PDP450'] = "Админка";
$locale['PDP451'] = "Нет записей";
$locale['PDP452'] = "Статус";
$locale['PDP453'] = "установить";
$locale['PDP454'] = "Лог записи";
$locale['PDP455'] = "Рапорт о битой ссылке.";
$locale['PDP456'] = "Обнулить";
$locale['PDP457'] = "Счетчик скачиваний";


// edit_misc.php
$locale['PDP500'] = "Дополнительно";
$locale['PDP501'] = "Скрыть имя пользователя";
$locale['PDP502'] = "Проверить загрузку";
$locale['PDP503'] = "Сделанные изменения будут проверены модератором. После проверки он сделает вашу загрузку доступной для скачивания.";
$locale['PDP504'] = "Go!";


// admin/settings.php
$locale['PDP700'] = "Настройки";
$locale['PDP701'] = "Название";
$locale['PDP702'] = "Загрузок на страницу";
$locale['PDP703'] = "Папка для Загрузок"; 
$locale['PDP704'] = "Папка для Скриншотов"; 
$locale['PDP705'] = "Приватные сообщения";
$locale['PDP706'] = "Отправлять персональное сообщение хозяину ссылки, о новых комментариях";
$locale['PDP707'] = "--не извещать--";
$locale['PDP708'] = "Показывать описания в категориях";
$locale['PDP709'] = "Не показывать скрытые или защищённые категории";
$locale['PDP710'] = "Приватное сообщение о новой загрузке отправлять";
$locale['PDP711'] = "Приватное сообщение о битой загрузке отправлять";
$locale['PDP712'] = "Не сообщать о бытых загрузках после";
$locale['PDP713'] = "Расширения писать через запятую, без пробелов";
$locale['PDP714'] = "Разрешенные типы: jpg,jpeg,gif,png";
$locale['PDP715'] = "Разрешенные типы: zip,rar,tar.gz,exe";
$locale['PDP716'] = "Максимальный размер файла";
$locale['PDP717'] = "В Байтах";
$locale['PDP718'] = "Лог изменений или обновлений к данной загрузке";
$locale['PDP719'] = "Пример: 1048576 Bytes = 1 MByte";
$locale['PDP720'] = "Пример: 2097152 Bytes = 2 MByte";
$locale['PDP721'] = "Пользователи могут редактировать загрузки";
$locale['PDP722'] = "Разрешонные";
$locale['PDP723'] = "Доступ для скачивания файлов с сервера";
$locale['PDP724'] = "Доступ для загрузки файлов на сервер";
$locale['PDP725'] = "Текст оповещения о битой ссылке";	//FIXME-better name
$locale['PDP726'] = "Разрешить коментарии";
$locale['PDP727'] = "Разрешить голосования";
$locale['PDP728'] = "от уровня пользователя";
$locale['PDP729'] = array(//FIXME
	0	=> "Гость",
	101	=> "Пользователь",
	102	=> "Администратор",
	103	=> "Супер Администратор",
);
$locale['PDP730'] = "Рапорты"; 
$locale['PDP731'] = "0-255: 0 не ограничено";
$locale['PDP732'] = array(
	"%ip"	=> "IP посетителей",
);
$locale['PDP733'] = "Сколько записей необходимо ждать, перед отправкой приватного сообщения админу?";
$locale['PDP734'] = "Диапазон: 0-255: 0 означает никогда";
$locale['PDP735'] = "Главные настройки";
$locale['PDP736'] = "Кто может сообщать о битой ссылке?";
$locale['PDP737'] = "Как долго сохранять метку файла как НОВЫЙ?";
$locale['PDP738'] = "Дней";
$locale['PDP739'] = "Тема";
$locale['PDP740'] = "Стандарт";
$locale['PDP741'] = "Пользователи могут скрывать свои имена";
$locale['PDP742'] = "Боковая панель";
$locale['PDP743'] = "Новые загрузки";
$locale['PDP744'] = "ТОП загрузок";


// admin/downloads.php
$locale['PDP750'] = "Активировать";
$locale['PDP751'] = "Все";
$locale['PDP752'] = "названия начинающиеся на";
$locale['PDP753'] = "Не активные загрузки";
$locale['PDP754'] = "Битые";


// admin/db_update.php
$locale['PDP780'] = "База данных обновлена";
$locale['PDP781'] = "Обновление Базы данных доступно";
$locale['PDP782'] = "Пожалуйста удостоверьтесь все действия с MySQL, выполненные успешно! Если дело обстоит не так, пожалуйста поправьте то о чем ошибка сообщает и повторите действие!";
$locale['PDP783'] = "Нажмите на соответствующую кнопку ниже, чтобы начать процесс обновления!";
$locale['PDP784'] = "Начинается обновление...";
$locale['PDP785'] = "Следующие таблицы и действия с MySQL будут выполнены";
$locale['PDP786'] = "Произошла ошибка во время обновления";
$locale['PDP787'] = "Ошибка";
$locale['PDP788'] = "Нет";
$locale['PDP789'] = "Вы не можете обновить вашу версию. Необходимо использовать последнюю версию";
$locale['PDP790'] = "Обновление прошло успешно!";


// admin/licenses.php
$locale['PDP800'] = "Вид лицензии";
$locale['PDP801'] = "Длина";
$locale['PDP802'] = "Пока что не лицензировано";


// admin/cats.php
$locale['PDP820'] = "Категории";
$locale['PDP821'] = "Главная категория";
$locale['PDP822'] = "Сортировать";
$locale['PDP823'] = array(
	"name"	=> "По имени",
	"mtime"	=> "По дате",
	"count"	=> "По популярности",
);
$locale['PDP824'] = array(
	"ASC"	=> "Возрастание",
	"DESC"	=> "Убывание",
);
$locale['PDP825'] = "Нет созданых категорий";
$locale['PDP826'] = "Загрузка с сервера - Разрешена";
$locale['PDP827'] = "Загрузка на сервер - Разрешена";
$locale['PDP828'] = "Позиция";


// admin/admin.php
$locale['PDP840'] = "Папки";
$locale['PDP841'] = "Папка для картинок - статус";
$locale['PDP842'] = "Папка для файлов - статус";
$locale['PDP843'] = "Новые загрузки";
$locale['PDP844'] = "Директория ненайдена или нет CHMOD прав на пререзапись";
//
$locale['PDP846'] = "Загрузки одной категорией";
$locale['PDP847'] = "Загрузки одной лицензии";
$locale['PDP848'] = "Битые загрузки";
//
//
$locale['PDP851'] = "Созданый в";
$locale['PDP852'] = "Следующие загрузки должны быть удалены";
$locale['PDP853'] = "Следующие загрузки должны быть проверены";


// admin/import.php
$locale['PDP860'] = "Импортировать найденое";
$locale['PDP861'] = "Импортирование выполнено!";
$locale['PDP862'] = "Начать импортирование...";
$locale['PDP863'] = "<b>Данные не могут быть импортированы!<br>Причины</b>";
$locale['PDP864'] = "Уже есть такие же данные";


// admin/del_download.php
$locale['PDP880'] = "Удаление файла с сервера";
$locale['PDP881'] = "<b>Вы почти удалили файл с сервера навсегда и без возможности восстановить!</b><br>Сводка";
$locale['PDP882'] = "хозяин";
$locale['PDP883'] = "Удалено...";
$locale['PDP884'] = "Загрузка удалена!";
$locale['PDP885'] = "Файлы не могут быть удалены потому что у директории %s нет прав на перезапись. Проверьте CHMOD";
$locale['PDP886'] = "Выбраные файлы будут удалены";
$locale['PDP887'] = "Действительно удалить файл?";
$locale['PDP888'] = "Я согласен, действительно удаляю эту загрузку.";


// MISC
$locale['PDP902']['subject'] = array(
	PDP_PM_COMMENT	=> "PDP: Новый коментарий",
	PDP_PM_NEW	=> "PDP: Новая загрузка",
	PDP_PM_BROKEN	=> "PDP: Загрузка битая",
	PDP_PM_CHANGES	=> "PDP: Загрузка была обновлена",
	PDP_PM_CHECK	=> "PDP: Загрузка должна быть проверена",
	PDP_PM_ACCEPTED	=> "PDP: Ваша загрузка активирована и доступна для скачивания.",
);
$locale['PDP902']['body'] = array(
	PDP_PM_COMMENT	=> "Новый коментарий был добавлен.",
	PDP_PM_NEW	=> "Новая загрузка была добавлена.",
	PDP_PM_BROKEN	=> "Загрузка была помечена как БИТАЯ.",
	PDP_PM_CHANGES	=> "Загрузка была обновлена.",
	PDP_PM_CHECK	=> "Загрузка была обновлена и теперь она должна быть быть проверена модератором.",
	PDP_PM_ACCEPTED	=> "Модератор опубликовал ваш файл для общего пользования.",
);

$locale['PDP903'] = array(
	PDP_EV_INVALID		=> "Неизвестное событие!",
	PDP_EV_NEW		=> "Новая загрузка.",
	PDP_EV_DESC		=> "Описание изменилось",
	PDP_EV_FILEFTP		=> "файл на FTP",
	PDP_EV_FILEURL		=> "URL файла",
	PDP_EV_FILEUPLOAD	=> "Файл загружен",
	PDP_EV_DELFILE		=> "Удалить файл",
	PDP_EV_DELPIC		=> "Удалить картинку",
	PDP_EV_PICUPLOAD	=> "Картинка загружена",
	PDP_EV_PICFTP		=> "Картинка на FTP",
	PDP_EV_STATUS		=> "Статус изменен",
	PDP_EV_CHEAT		=> "Мошенник :)",
	PDP_EV_CLEARLOG		=> "Лог файла уничтожен",
	PDP_EV_RESETBROKEN	=> "Рапортование по битым ссылкам сброшено на ноль.",
	PDP_EV_PICDESC		=> "Описание картинки изменено",
	PDP_EV_PICURL		=> "Внешний URL изображения",
);

$locale['PDP904'] = array(
	PDP_PRO_ON	=> "Доступен",
	PDP_PRO_OFF	=> "Запрещён",
	PDP_PRO_NEW	=> "Новый",
	PDP_PRO_DEL	=> "Удалённ...",
	PDP_PRO_CHECK	=> "Проверка.",
);
?>
